ТОИР_демо/src/Catalogs/торо_СобытияУведомленийВДокументах/торо_СобытияУведомленийВДокументах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СобытияУведомленийВДокументах</name>
  <attributes>
    <name>ШаблонСообщения</name>
    <type>
      <types>CatalogRef.торо_ШаблоныСообщенийИУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьВсплывающиеУведомления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПочтовыеУведомления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оповещаемые</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отбор</name>
    <attributes>
      <name>НаименованиеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_родителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_СобытияУведомленийВДокументах/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОповещаемые
&НаКлиенте
Процедура ОповещаемыеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		СписокДоступныхТипов = Новый СписокЗначений;
		
		СписокДоступныхТипов.Добавить("Пользователи");
		СписокДоступныхТипов.Добавить("Ответственный по документу");
		
		Если торо_Согласования.ПроверитьИспользованиеСогласованияДокументов() Тогда
			
			СписокДоступныхТипов.Добавить("Согласующие");
			СписокДоступныхТипов.Добавить("Оповещаемые");
			
		КонецЕсли;
		
		ВыбранныйТип = Неопределено;

		
		СписокДоступныхТипов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОповещаемыеПриНачалеРедактированияЗавершение", ЭтотОбъект), НСтр("ru = 'Кому формировать уведомления'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОповещаемыеПриНачалеРедактированияЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    ВыбранныйТип = ВыбранныйЭлемент;
    
    Если ВыбранныйТип <> Неопределено Тогда	
        Если ВыбранныйТип.Значение = "Пользователи" Тогда
            
            Элементы.Оповещаемые.ТекущиеДанные.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
            
        Иначе
            
            Элементы.Оповещаемые.ТекущиеДанные.Пользователь = ВыбранныйТип;
            
        КонецЕсли;
    Иначе
        Элементы.Оповещаемые.ТекущиеДанные.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
    КонецЕсли;
    
КонецПроцедуры


#КонецОбласти
